[Demo_CommonAD_ep3_1 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=2136,Y=-2383,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0300_lp_Furry",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_001_Cue',Name="エコロ")
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[13]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[15]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0301_fx_Furry2Stand",Rate=0,Number=2,Bit=0)
DemoScripts[16]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[17]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_003_Cue',Name="エコロ")
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[19]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[20]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_fx_close_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0102_fx_Stand2Displease",Rate=0,Number=3,Bit=0)
DemoScripts[21]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0200_lp_Displease",Number=8)
DemoScripts[22]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_004_Cue',Name="エコロ")
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[24]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[25]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0201_fx_Displease2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[26]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[27]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_005_Cue',Name="エコロ")
DemoScripts[28]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[29]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[30]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[31]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0201_lp_half_angry",Rate=0,Number=0,Bit=1)
DemoScripts[32]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_007_Cue',Name="エコロ")
DemoScripts[33]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[34]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[35]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[36]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_fx_close_normal",Rate=0,Number=0,Bit=0)
DemoScripts[37]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_009_Cue',Name="エコロ")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[39]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[40]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[41]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_CommonAD_ep3_1.GG2_V_CMNAD_ep3_1_010_Cue',Name="エコロ")
DemoScripts[42]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[43]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[44]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[45]=(Actor=WINDOW,Command=EXIT)
DemoScripts[46]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[47]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[48]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[49]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[50]=(Actor=SYSTEM,Command=END)

[Select_CommonAD_ep3_1 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_CommonAD_ep3_1 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="雖然也很在意惡魔的惡作劇,/n但現在還是該以尋找命運的對象為優先./n沒有時間搭理區區惡魔了!")

Texts[1]=(Label="TEXT02",Name="峯大",Text="不......真要說的話,我覺得/n一直執著於惡魔的人是妳耶......")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="真失禮!/n你的意思是,身為精英天使的我/n執著於那種區區見習惡魔嗎?")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="不過,我好歹也是天使的一份子./n萬一遇上了,我可是一點都沒有/n手下留情的打算哦.")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="......峯大大人才是,造成現在/n這樣的狀況也是那個惡魔的錯,/n所以再多燃起一點復仇心也沒關係唷.")

Texts[5]=(Label="TEXT06",Name="峯大",Text="復仇心這種話是天使該說的嗎....../n(是說她根本就/n在意得不得了嘛......)")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="你剛纔是不是在想/n我根本就在意得不得了嘛?")

Texts[7]=(Label="TEXT08",Name="峯大",Text="......才沒這種事呢.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="......好吧,算了./n比起這個,現在要來尋找命運的對象.")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="首先就到人多的地方/n不斷走動吧.")

Texts[10]=(Label="TEXT11",Name="峯大",Text="OK./n也只能這樣了吧.")

Texts[11]=(Label="",Name="",Text="")

Texts[12]=(Label="SELECT01",Name="",Text="")

Texts[13]=(Label="SELECT02",Name="",Text="")

Texts[14]=(Label="SELECT03",Name="",Text="")

Texts[15]=(Label="SELECT04",Name="",Text="")

Texts[16]=(Label="SELECT05",Name="",Text="")

Texts[17]=(Label="SELECT06",Name="",Text="")

Texts[18]=(Label="SELECT07",Name="",Text="")

Texts[19]=(Label="SELECT08",Name="",Text="")

Texts[20]=(Label="SELECT09",Name="",Text="")

Texts[21]=(Label="SELECT10",Name="",Text="")


